interface Paymethod {
    วิธีการชำระเงิน: string;

    ชำระเงิน(จำนวนเงิน: number): void;
}

class การชำระเงินด้วยบัตรเครดิต implements Paymethod {
    วิธีการชำระเงิน: string = "การชำระเงินด้วยบัตรเครดิต";
    หมายเลขบัตรเครดิต: string;

    constructor(หมายเลขบัตรเครดิต: string) {
        this.หมายเลขบัตรเครดิต = หมายเลขบัตรเครดิต;
    }

    ชำระเงิน(จำนวนเงิน: number): void {
        console.log(
            `ชำระเงิน ${จำนวนเงิน} บาท โดยใช้บัตรเครดิตหมายเลข${this.หมายเลขบัตรเครดิต}`
        );
    }
}

let payment = new การชำระเงินด้วยบัตรเครดิต("6842450026843");

payment.ชำระเงิน(500);
